In [2]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\miki_\anaconda3\lib\site-packages (3.0.5)
Requirement already satisfied: et-xmlfile in c:\users\miki_\anaconda3\lib\site-packages (from openpyxl) (1.0.1)
Requirement already satisfied: jdcal in c:\users\miki_\anaconda3\lib\site-packages (from openpyxl) (1.4.1)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [4]:
q32015 = "../housingcsv/2015q3.xlsx"
df1 = pd.read_excel(q32015,engine='openpyxl')
refine1 = df1.drop(['Sales\n3Q 2014', 'Median\n3Q 2014', 'Median\nChange'], axis=1)
refine1 = refine1.rename(columns={'Sales\n3Q 2015': 'Sales Q3 2015', 'Median\n3Q 2015': 'Median Q3 2015'})
refine1

               City          Suburb  Sales Q3 2015  Median Q3 2015
0          ADELAIDE        ADELAIDE            5.0        600000.0
1          ADELAIDE  NORTH ADELAIDE            6.0       1370000.0
2    ADELAIDE HILLS         ALDGATE            6.0        802500.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
472    WEST TORRENS       THEBARTON            3.0        546000.0
473    WEST TORRENS    TORRENSVILLE           12.0        602500.0
474    WEST TORRENS       UNDERDALE            7.0        580000.0
475    WEST TORRENS      WEST BEACH            8.0        728000.0
476    WEST TORRENS   WEST RICHMOND            3.0        392500.0

[477 rows x 4 columns]

In [5]:
q42015 = '../housingcsv/2015q4.xlsx'
df2 = pd.read_excel(q42015,engine='openpyxl')
refine2 = df2.drop(['Sales\n4Q 2014', 'Median\n4Q 2014', 'Median\nChange'], axis=1)
refine2 = refine2.rename(columns={'Sales\n4Q 2015': 'Sales Q4 2015', 'Median\n4Q 2015': 'Median Q4 2015'})
refine2

               City          Suburb  Sales Q4 2015  Median Q4 2015
0          ADELAIDE        ADELAIDE            5.0        320000.0
1          ADELAIDE  NORTH ADELAIDE            4.0       1300000.0
2    ADELAIDE HILLS         ALDGATE            7.0        668750.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
473    WEST TORRENS    TORRENSVILLE           10.0        576250.0
474    WEST TORRENS       UNDERDALE            3.0        511000.0
475    WEST TORRENS      WEST BEACH            8.0        633500.0
476    WEST TORRENS   WEST RICHMOND            4.0        353000.0
477             NaN             NaN            NaN             NaN

[478 rows x 4 columns]

In [6]:
q12016 = '../housingcsv/2016q1.xlsx'
df3 = pd.read_excel(q12016,engine='openpyxl')
refine3 = df3.drop(['Sales\n1Q 2015', 'Median\n1Q 2015', 'Median\nChange'], axis=1)
refine3 = refine3.rename(columns={'Sales\n1Q 2016': 'Sales Q1 2016', 'Median\n1Q 2016': 'Median Q1 2016'})
refine3

               City          Suburb  Sales Q1 2016  Median Q1 2016
0          ADELAIDE        ADELAIDE            3.0        750000.0
1          ADELAIDE  NORTH ADELAIDE           10.0        900500.0
2    ADELAIDE HILLS         ALDGATE           13.0        715000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
473    WEST TORRENS    TORRENSVILLE            7.0        537500.0
474    WEST TORRENS       UNDERDALE            3.0        533000.0
475    WEST TORRENS      WEST BEACH            7.0        825000.0
476    WEST TORRENS   WEST RICHMOND            3.0        410000.0
477             NaN             NaN            NaN             NaN

[478 rows x 4 columns]

In [7]:
q22016 = '../housingcsv/2016q2.xlsx'
df4 = pd.read_excel(q22016,engine='openpyxl')
refine4 = df4.drop(['Sales\n2Q 2015', 'Median\n2Q 2015', 'Median\nChange'], axis=1)
refine4 = refine4.rename(columns={'Sales\n2Q 2016': 'Sales Q2 2016', 'Median\n2Q 2016': 'Median Q2 2016'})
refine4

               City          Suburb  Sales Q2 2016  Median Q2 2016
0          ADELAIDE        ADELAIDE            NaN             NaN
1          ADELAIDE  NORTH ADELAIDE           14.0        892500.0
2    ADELAIDE HILLS         ALDGATE           16.0        750000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
473    WEST TORRENS       THEBARTON            6.0        498750.0
474    WEST TORRENS    TORRENSVILLE            7.0        627500.0
475    WEST TORRENS       UNDERDALE            8.0        529000.0
476    WEST TORRENS      WEST BEACH            7.0        706000.0
477    WEST TORRENS   WEST RICHMOND            1.0        390000.0

[478 rows x 4 columns]

In [8]:
merged1 = pd.merge(refine1,refine2)
merged2 = pd.merge(refine3,refine4)
final = pd.merge(merged1,merged2)
final = final.dropna(how='any')
final

,City,Suburb,Sales Q3 2015,Median Q3 2015,Sales Q4 2015,Median Q4 2015,Sales Q1 2016,Median Q1 2016,Sales Q2 2016,Median Q2 2016
1,ADELAIDE,NORTH ADELAIDE,6.0,1370000.0,4.0,1300000.0,10.0,900500.0,14.0,892500.0
2,ADELAIDE HILLS,ALDGATE,6.0,802500.0,7.0,668750.0,13.0,715000.0,16.0,750000.0
5,ADELAIDE HILLS,BELAIR,23.0,540000.0,16.0,550000.0,13.0,577500.0,15.0,561000.0
7,ADELAIDE HILLS,BRIDGEWATER,16.0,465000.0,12.0,477000.0,16.0,475000.0,18.0,432000.0
12,ADELAIDE HILLS,CRAFERS,7.0,617500.0,3.0,678250.0,8.0,640500.0,3.0,537000.0
...,...,...,...,...,...,...,...,...,...,...
471,WEST TORRENS,RICHMOND,9.0,420000.0,4.0,526500.0,11.0,456500.0,10.0,546000.0
473,WEST TORRENS,TORRENSVILLE,12.0,602500.0,10.0,576250.0,7.0,537500.0,7.0,627500.0
474,WEST TORRENS,UNDERDALE,7.0,580000.0,3.0,511000.0,3.0,533000.0,8.0,529000.0
475,WEST TORRENS,WEST BEACH,8.0,728000.0,8.0,633500.0,7.0,825000.0,7.0,706000.0
476,WEST TORRENS,WEST RICHMOND,3.0,392500.0,4.0,353000.0,3.0,410000.0,1.0,390000.0

In [12]:
# add new column to hold median price of the year
new_col=[""]
final["y15_16_price"]=(final["Median Q3 2015"]+final["Median Q4 2015"]+final["Median Q1 2016"]+final["Median Q2 2016"])/4
final
y15_16_price=final
y15_16_price

#add new column to hold total sales for whole year
new_col=[""]
final["sales_15_16"]=(final["Sales Q3 2015"]+final["Sales Q4 2015"]+final["Sales Q1 2016"]+final["Sales Q2 2016"])
y19_20_price=final
y19_20_price

,City,Suburb,Sales Q3 2015,Median Q3 2015,Sales Q4 2015,Median Q4 2015,Sales Q1 2016,Median Q1 2016,Sales Q2 2016,Median Q2 2016,y15_16_price,sales_15_16
1,ADELAIDE,NORTH ADELAIDE,6.0,1370000.0,4.0,1300000.0,10.0,900500.0,14.0,892500.0,1115750.0,34.0
2,ADELAIDE HILLS,ALDGATE,6.0,802500.0,7.0,668750.0,13.0,715000.0,16.0,750000.0,734062.5,42.0
5,ADELAIDE HILLS,BELAIR,23.0,540000.0,16.0,550000.0,13.0,577500.0,15.0,561000.0,557125.0,67.0
7,ADELAIDE HILLS,BRIDGEWATER,16.0,465000.0,12.0,477000.0,16.0,475000.0,18.0,432000.0,462250.0,62.0
12,ADELAIDE HILLS,CRAFERS,7.0,617500.0,3.0,678250.0,8.0,640500.0,3.0,537000.0,618312.5,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...
471,WEST TORRENS,RICHMOND,9.0,420000.0,4.0,526500.0,11.0,456500.0,10.0,546000.0,487250.0,34.0
473,WEST TORRENS,TORRENSVILLE,12.0,602500.0,10.0,576250.0,7.0,537500.0,7.0,627500.0,585937.5,36.0
474,WEST TORRENS,UNDERDALE,7.0,580000.0,3.0,511000.0,3.0,533000.0,8.0,529000.0,538250.0,21.0
475,WEST TORRENS,WEST BEACH,8.0,728000.0,8.0,633500.0,7.0,825000.0,7.0,706000.0,723125.0,30.0
476,WEST TORRENS,WEST RICHMOND,3.0,392500.0,4.0,353000.0,3.0,410000.0,1.0,390000.0,386375.0,11.0

In [10]:
final.to_csv("y15_16_house.csv")

In [11]:
%store y15_16_price

Stored 'y15_16_price' (DataFrame)

In [13]:
# set up a new datafram to hold just suburb, sales count and median price for scatter plot
refined_Y1516=pd.DataFrame([y15_16_price.Suburb,y15_16_price.y15_16_price,y15_16_price.sales_15_16]).transpose()
refined_Y1516

             Suburb y15_16_price sales_15_16
1    NORTH ADELAIDE  1.11575e+06          34
2           ALDGATE       734062          42
5            BELAIR       557125          67
7       BRIDGEWATER       462250          62
12          CRAFERS       618312          21
..              ...          ...         ...
471        RICHMOND       487250          34
473    TORRENSVILLE       585938          36
474       UNDERDALE       538250          21
475      WEST BEACH       723125          30
476   WEST RICHMOND       386375          11

[327 rows x 3 columns]

In [14]:
# sort by median price and retrieve just 10
bottom_10_price=refined_Y1516.sort_values(by=['y15_16_price'],ascending=True)
bottom_10_price=bottom_10_price.head(10)

# format price
bottom_10_price["y15_16_price"]=bottom_10_price["y15_16_price"].map("{:,}".format)

print(f"Bottom 10 ranking in median price Suburbs\n{bottom_10_price}\n")

Bottom 10 ranking in median price Suburbs
                Suburb y15_16_price sales_15_16
305  SMITHFIELD PLAINS   181,383.25          22
280       DAVOREN PARK    185,262.5          83
284    ELIZABETH DOWNS    188,250.0          75
287    ELIZABETH NORTH    192,875.0          36
288     ELIZABETH PARK    206,937.5          55
285     ELIZABETH EAST    212,000.0          60
286    ELIZABETH GROVE  218,608.625          22
289    ELIZABETH SOUTH    227,312.5          17
283          ELIZABETH    227,437.5          13
290     ELIZABETH VALE    239,250.0          41

In [16]:
# sort by median price and retrieve just 10
top_10_price=refined_Y1516.sort_values(by=['y15_16_price'],ascending=False)
top_10_price=top_10_price.head(10)

# format price
top_10_price["y15_16_price"]=top_10_price["y15_16_price"].map("{:,}".format)

print(f"Top 10 ranking in median price Suburbs\n{top_10_price}\n")

Top 10 ranking in median price Suburbs
             Suburb  y15_16_price sales_15_16
445      UNLEY PARK   1,633,937.5          16
58        ROSE PARK   1,410,875.0           8
218       ST PETERS   1,349,400.0          37
209       KENT TOWN   1,349,387.5           6
63   TOORAK GARDENS   1,275,262.5          24
441       MILLSWOOD   1,256,875.0          20
64          TUSMORE  1,254,562.75          14
440         MALVERN   1,184,750.0          35
42          DULWICH   1,139,375.0          20
103        TENNYSON   1,125,500.0           9